In [4]:
import pandas as pd

In [7]:
from pandas import Series, DataFrame

In [9]:
obj=pd.Series([4,7,-5,3])

In [10]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [11]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
obj2=pd.Series([4,7,-5,3], index=['a','b', 'c','d'])

In [16]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [17]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
obj2['a']

4

In [19]:
obj2['c']

-5

In [22]:
obj2[['a','b','a']]

a    4
b    7
a    4
dtype: int64

In [23]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [24]:
sdata={'A':123, 'B':400, 'C':700, 'D':1000}

In [25]:
obj3=pd.Series(sdata)

In [26]:
obj3

A     123
B     400
C     700
D    1000
dtype: int64

In [27]:
Alphabet=['Z','A','C','B']

In [28]:
obj4=pd.Series(sdata,index=Alphabet)

In [29]:
obj4

Z      NaN
A    123.0
C    700.0
B    400.0
dtype: float64

In [30]:
obj3+obj4

A     246.0
B     800.0
C    1400.0
D       NaN
Z       NaN
dtype: float64

In [33]:
data={'day' : ['Mon','Mon','Mon','Thu','Fri','Sat','Sun'],
      'year' : [2000,2001,2002,2003,2007,2010,2020],
      'pop' : [1.1, 1.5, 3.1, 2.5, 2.9, 3.2, 3.5]}

In [34]:
frame=pd.DataFrame(data)

In [35]:
frame

   day  year  pop
0  Mon  2000  1.1
1  Mon  2001  1.5
2  Mon  2002  3.1
3  Thu  2003  2.5
4  Fri  2007  2.9
5  Sat  2010  3.2
6  Sun  2020  3.5

In [36]:
frame.head()

   day  year  pop
0  Mon  2000  1.1
1  Mon  2001  1.5
2  Mon  2002  3.1
3  Thu  2003  2.5
4  Fri  2007  2.9

In [38]:
frame2=pd.DataFrame(data, columns=['year','day','pop','debt'],
                    index=['one','two','three','four','five','six','seven'])

In [39]:
frame2

       year  day  pop debt
one    2000  Mon  1.1  NaN
two    2001  Mon  1.5  NaN
three  2002  Mon  3.1  NaN
four   2003  Thu  2.5  NaN
five   2007  Fri  2.9  NaN
six    2010  Sat  3.2  NaN
seven  2020  Sun  3.5  NaN

In [40]:
frame2.columns

Index(['year', 'day', 'pop', 'debt'], dtype='object')

In [41]:
frame2.loc['four']

year    2003
day      Thu
pop      2.5
debt     NaN
Name: four, dtype: object

In [45]:
frame2['debt']=13.3

In [52]:
frame2

       year  day  pop  debt
one    2000  Mon  1.1  13.3
two    2001  Mon  1.5  13.3
three  2002  Mon  3.1  13.3
four   2003  Thu  2.5  13.3
five   2007  Fri  2.9  13.3
six    2010  Sat  3.2  13.3
seven  2020  Sun  3.5  13.3

In [53]:
import numpy as np

In [56]:
frame2['debt']=np.arange(7.)

In [57]:
frame2

       year  day  pop  debt
one    2000  Mon  1.1   0.0
two    2001  Mon  1.5   1.0
three  2002  Mon  3.1   2.0
four   2003  Thu  2.5   3.0
five   2007  Fri  2.9   4.0
six    2010  Sat  3.2   5.0
seven  2020  Sun  3.5   6.0

In [58]:
frame2['eastern']=frame2.day=='Mon'

In [59]:
frame2

       year  day  pop  debt  eastern
one    2000  Mon  1.1   0.0     True
two    2001  Mon  1.5   1.0     True
three  2002  Mon  3.1   2.0     True
four   2003  Thu  2.5   3.0    False
five   2007  Fri  2.9   4.0    False
six    2010  Sat  3.2   5.0    False
seven  2020  Sun  3.5   6.0    False

In [60]:
del frame2['eastern']

In [62]:
frame2.columns

Index(['year', 'day', 'pop', 'debt'], dtype='object')

In [63]:
pop={'Mon':{2001: 1.1, 2002:3.1},
     'Sun':{2020: 3.5}}

In [64]:
frame3=pd.DataFrame(pop)

In [65]:
frame3

      Mon  Sun
2001  1.1  NaN
2002  3.1  NaN
2020  NaN  3.5

In [66]:
frame3.T

     2001  2002  2020
Mon   1.1   3.1   NaN
Sun   NaN   NaN   3.5

In [67]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Mon  Sun
2001  1.1  NaN
2002  3.1  NaN
2003  NaN  NaN

In [68]:
obj=pd.Series(range(3), index=['a','b','c'])

In [69]:
index=obj.index

In [70]:
index

Index(['a', 'b', 'c'], dtype='object')

In [71]:
index[:1]

Index(['a'], dtype='object')

In [86]:
index[1]='c'

TypeError: Index does not support mutable operations

In [87]:
labels=pd.Index(np.arange(3))

In [88]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [92]:
obj2=pd.Series([1.5,-2.5,0], index=labels)

In [93]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [94]:
obj2.index is labels

True

In [95]:
frame3

      Mon  Sun
2001  1.1  NaN
2002  3.1  NaN
2020  NaN  3.5

In [96]:
frame3.columns

Index(['Mon', 'Sun'], dtype='object')

In [97]:
'Mon' in frame3.columns

True

In [98]:
2000 in frame3.columns

False

In [99]:
dup_labels=pd.Index(['foo','foo','bar','bar'])

In [100]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')